{
  "forbidden": "You don't have permission to access the requested resource",
  "unauthenticated": "You are not authenticated",
  "accessDenied": "Access denied due to invalid credentials",
  "internalServerError": "Oops ! Something went wrong. Our server encountered an internal error and was unable to handle your request. We're working on it. Please try again later.",
  "validationError": "Submitted data is not valid",
  "notFound": "The requested resource is not found",
  "invalidId": "The provided ID is not valid",
  "invalidId_plural": "The provided IDs are not valid",
  "invalidFilter": "Invalid filter criteria",
  "categoryNotFound": "There is no existing category corresponding to the provided identifier",
  "category.nameAlreadyExists": "A category with the same name already exists",
  "recipeSourceNotFound": "There is no existing recipe source corresponding to the provided identifier",
  "recipeSource.nameAlreadyExists": "A recipe source with the same name already exists",
  "recipeSource.websiteAlreadyExists": "A recipe source with the same website already exists",
  "accountNotFound": "The account cannot be found",
  "account.cannotFollowYourself": "You cannot follow yourself",
  "account.cannotReportAbuseOnYourData": "You cannot report abuse on your own data",
  "account.alreadyExists": "This account already exists",
  "emailAlreadyExists": "The provided email is already in use by an existing user",
  "phoneNumberAlreadyExists": "The provided phoneNumber is already in use by an existing user",
  "userNotFound": "There is no existing user corresponding to the provided identifier",
  "recipeNotFound": "There is no existing recipe corresponding to the provided identifier",
  "recipeAlreadyFavorite": "This recipe already exists in your favorite list",
  "recipeCollectionNotFound": "There is no existing collection corresponding to the provided identifier",
  "recipeCollectionAlreadyExists": "This collection is already exists",
  "shoppingListItemNotFound": "There is no existing shopping list item corresponding to the identifier provided",
  "commentNotFound": "There is no existing comment corresponding to the provided identifier",
  "abuseReportNotFound": "There is no abuse reported corresponding to your request",
  "notificationNotFound": "There is no existing notification corresponding to the provided identifier"
}
