{
  "forbidden": "Vous n'êtes pas autorisé à accéder à la ressource demandée",
  "unauthenticated" :"Vous n'êtes pas authentifié",
  "accessDenied": "Accès refusé en raison d'informations d'identification non valides",
  "invalidId": "L'ID fourni n'est pas valide",
  "invalidId_plural": "Les identifiants fournis ne sont pas valides",
  "validationError": "Les données soumises ne sont pas valides",
  "notFound": "La ressource demandée est introuvable",
  "invalidFilter": "Critères de filtre non valides",
  "internalServerError": "Oups ! Quelque chose a mal tourné. Notre serveur a rencontré une erreur interne et n'a pas pu traiter votre demande. Nous y travaillons. Veuillez réessayer plus tard.",
  "categoryNotFound": "Il n'y a aucune categorie existante correspondant à l'identifiant fourni",
  "category.nameAlreadyExists": "Une catégorie du même nom existe déjà",
  "recipeSourceNotFound": "Il n'y a aucune source de recette existante correspondant à l'identifiant fourni",
  "recipeSource.nameAlreadyExists": "Une source de recette du même nom existe déjà",
  "recipeSource.websiteAlreadyExists": "Une source de recette avec le même site web existe déjà",
  "accountNotFound": "Il n'y a aucun compte existant correspondant à l'identifiant fourni",
  "account.cannotFollowYourself": "Vous ne pouvez pas vous abonner à vous-même",
  "account.cannotReportAbuseOnYourData": "Vous ne pouvez pas signaler vos propres données",
  "account.alreadyExists": "Ce compte existe déjà",
  "emailAlreadyExists": "L'e-mail fourni est déjà utilisé par un utilisateur existant",
  "phoneNumberAlreadyExists": "Le numéro de téléphone fourni est déjà utilisé par un utilisateur existant",
  "userNotFound": "Il n'y a aucun utilisateur existant correspondant à l'identifiant fourni",
  "recipeNotFound": "Il n'y a aucune recette existante correspondant à l'identifiant fourni",
  "recipeCollectionNotFound": "Il n'y a aucune collection existante correspondant à l'identifiant fourni",
  "recipeCollectionAlreadyExists": "Une collection du même nom existe déjà",
  "recipeAlreadyFavorite": "Cette recette existe déjà dans votre liste de favoris",
  "shoppingListItemNotFound": "Il n'y a aucun élément de liste de courses correspondant à l'identifiant fourni",
  "commentNotFound": "Il n'y a aucun commentaire existant correspondant à l'identifiant fourni",
  "abuseReportNotFound": "Il n'y a aucun abus signalé correspondant à votre requête",
  "notificationNotFound": "Il n'y a aucun notification correspondant à l'identifiant fourni"
}
